Renova/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПродано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПроизведено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МоделиПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фирма</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцПродаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/AccumulationRegisters/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Производство</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПродано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПроизведено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МоделиПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/CommonModules/РаботаСФайломСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьДанныеИзФайла(ПутьФайла, Кодировка = Неопределено) Экспорт 
	
	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	
	Чтение = Новый ЧтениеТекста(ПутьФайла, Кодировка); 
	
	Попытка
		// Чтение заголовка (4 строки)
		СтрокиЗаголовка = Новый Массив;
		Для Индекс = 1 По 4 Цикл
			Стр = Чтение.ПрочитатьСтроку();
			Если Стр = Неопределено Тогда
				ВызватьИсключение "Файл содержит менее 4 строк";
			КонецЕсли;
			СтрокиЗаголовка.Добавить(Стр);
		КонецЦикла;
		
		//Вид документа
		ДокументСтрока = СтрокиЗаголовка[0];
		Документ = СокрЛП(ДокументСтрока); 
		
		// Фирма производитель
		ФирмаСтрока = СтрокиЗаголовка[1];
		Части = СтрРазделить(ФирмаСтрока, Символы.Таб, Ложь);
		Фирма = СокрЛП(Части[1]);
		
		// Период
		СтрокаПериода = СтрокиЗаголовка[2];
		Части = СтрРазделить(СтрокаПериода, Символы.Таб, Ложь);
		Если Части.Количество() < 2 Тогда
			ВызватьИсключение "Не удалось извлечь даты периода";
		КонецЕсли;
		
		НачалоПериода = РаботаСоСтрокойСервер.ПреобразоватьДатуИзДвузначногоГода(СокрЛП(Части[0]));
		КонецПериода   = РаботаСоСтрокойСервер.ПреобразоватьДатуИзДвузначногоГода(СокрЛП(Части[1]));
		
		// Получаем массив дат месяцев
		МассивДат = РаботаСоСтрокойСервер.ПолучитьМассивДатМесяцев(НачалоПериода, КонецПериода);
		
		// Чтение данных по кодам
		ДанныеПоКодам = Новый Соответствие; // Ключ - код, значение - массив количеств
		Пока Истина Цикл
			Стр = Чтение.ПрочитатьСтроку();
			
			Если Стр = Неопределено Тогда 
				Прервать; 
			КонецЕсли;
			Если ПустаяСтрока(Стр) Тогда 
				Продолжить; 
			КонецЕсли;
			
			ЧастиСтроки = СтрРазделить(Стр, Символы.Таб, Истина);
			Если ЧастиСтроки.Количество() < 2 Тогда 
				Продолжить; 
			КонецЕсли;
			
			Код = СокрЛП(ЧастиСтроки[0]);
			Если ПустаяСтрока(Код) Тогда 
				Продолжить; 
			КонецЕсли;
			
			Количество = Новый Массив;
			Для Инд = 2 По ЧастиСтроки.Количество() - 1 Цикл
				Попытка
					Количество.Добавить(Число(ЧастиСтроки[Инд]));
				Исключение
					Количество.Добавить(0);
				КонецПопытки;
			КонецЦикла;
			
			ДанныеПоКодам.Вставить(Код, Количество);
		КонецЦикла;
		
		Чтение.Закрыть();
		
		// Формируем результат
		Результат = Новый Структура;
		Результат.Вставить("Документ", Документ); 
		Результат.Вставить("Фирма", Фирма);
		Результат.Вставить("НачалоПериода", НачалоПериода);
		Результат.Вставить("КонецПериода", КонецПериода);
		Результат.Вставить("ДанныеПоКодам", ДанныеПоКодам);
		Результат.Вставить("МассивДат", МассивДат);
		
		Возврат Результат;
		
	Исключение
		Чтение.Закрыть();
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьЗапрещенныеКомбинацииПродажПоТаблице(ТаблицаТоваров, ДатаДокумента) Экспорт 
	
    МассивНоменклатуры = ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура");
    МассивМесяцев = ТаблицаТоваров.ВыгрузитьКолонку("МесяцПродаж");

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Продажи.МоделиПродукции КАК МоделиПродукции,
    |    МАКСИМУМ(Продажи.Период) КАК Период,
    |    Продажи.МесяцПродаж КАК МесяцПродаж
    |ИЗ
    |    РегистрНакопления.Продажи КАК Продажи
    |ГДЕ
    |    Продажи.МоделиПродукции В(&Модель)
    |    И Продажи.МесяцПродаж В(&Месяц)
    |СГРУППИРОВАТЬ ПО
    |    Продажи.МоделиПродукции,
    |    Продажи.МесяцПродаж";

    Запрос.УстановитьПараметр("Модель", МассивНоменклатуры);
    Запрос.УстановитьПараметр("Месяц", МассивМесяцев);

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Запрет = Новый Соответствие;
    Пока Выборка.Следующий() Цикл
        Если Выборка.Период > ДатаДокумента Тогда
            Ключ = Строка(Выборка.МоделиПродукции) + "|" + Формат(Выборка.МесяцПродаж, "ДФ=yyyyMMdd");
            Запрет.Вставить(Ключ, Выборка.Период);
        КонецЕсли;
    КонецЦикла;

    Возврат Запрет;
КонецФункции

Функция ПолучитьЗапрещенныеКомбинацииПроизводстваПоТаблице(ТаблицаТоваров, ДатаДокумента) Экспорт 	
		
    МассивНоменклатуры = ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура");
    МассивМесяцев = ТаблицаТоваров.ВыгрузитьКолонку("МесяцПроизводства");

    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Производство.МоделиПродукции КАК МоделиПродукции,
	               |	Производство.МесяцПроизводства КАК МесяцПроизводства,
	               |	МАКСИМУМ(Производство.Период) КАК Период
	               |ИЗ
	               |	РегистрНакопления.Производство КАК Производство
	               |ГДЕ
	               |	Производство.МоделиПродукции В(&Модель)
	               |	И Производство.МесяцПроизводства В(&Месяц)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Производство.МесяцПроизводства,
	               |	Производство.МоделиПродукции";
    Запрос.УстановитьПараметр("Модель", МассивНоменклатуры);
    Запрос.УстановитьПараметр("Месяц", МассивМесяцев);

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Запрет = Новый Соответствие;
    Пока Выборка.Следующий() Цикл
        Если Выборка.Период > ДатаДокумента Тогда
            Ключ = Строка(Выборка.МоделиПродукции) + "|" + Формат(Выборка.МесяцПроизводства, "ДФ=yyyyMMdd");
            Запрет.Вставить(Ключ, Выборка.Период);
        КонецЕсли;
    КонецЦикла;

    Возврат Запрет;
	
КонецФункции

#КонецОбласти
